4.1 数据清洗

4.1.1 空值和缺失值的处理

In [13]:
import numpy as np
np.nan   #nan 缺失值

nan

In [14]:
type(np.nan)

float

In [15]:
from pandas import DataFrame, Series
import pandas as pd
from numpy import NaN
series_obj = Series([1, None, NaN])
series_obj

0    1.0
1    NaN
2    NaN
dtype: float64

In [16]:
pd.isnull(series_obj)       # 检查是否为空值或缺失值

0    False
1     True
2     True
dtype: bool

In [17]:
series_obj = Series([1, None, NaN])     #创建包含空值和缺失值的series对象
pd.notnull(series_obj)       # 检查是否不为空值或缺失值

0     True
1    False
2    False
dtype: bool

In [18]:
import pandas as pd
import numpy as np
df_obj = pd.DataFrame({"类别":['小说', '散文随笔', '青春文学', '传记'],
                       "书名":[np.nan, '《皮囊》', '《旅程结束时》', '《老舍自传》'],
                       "作者":["老舍", None, "张其鑫", "老舍"]})
df_obj

     类别       书名    作者
0    小说      NaN    老舍
1  散文随笔     《皮囊》  None
2  青春文学  《旅程结束时》   张其鑫
3    传记   《老舍自传》    老舍

In [20]:
df_obj.dropna(axis=1)

     类别
0    小说
1  散文随笔
2  青春文学
3    传记

In [19]:
df_obj.dropna()     # 删除数据集中的空值和缺失值

     类别       书名   作者
2  青春文学  《旅程结束时》  张其鑫
3    传记   《老舍自传》   老舍

In [21]:
df_obj = pd.DataFrame({'A': [1, 2, 3, NaN],
                       'B': [NaN, 4, NaN, 6],
                       'C': ['a', 7, 8, 9],
                       'D':[NaN, 2, 3, NaN]})
df_obj

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [22]:
df_obj.fillna('66.0')   # 使用66替换缺失值

      A     B  C     D
0   1.0  66.0  a  66.0
1   2.0   4.0  7   2.0
2   3.0  66.0  8   3.0
3  66.0   6.0  9  66.0

In [23]:
df_obj = pd.DataFrame({'A': [1, 2, 3, NaN],
                       'B': [NaN, 4, NaN, 6],
                       'C': ['a', 7, 8, 9],
                       'D': [NaN, 2, 3, NaN]})
df_obj

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [24]:
df_obj.fillna({'A': 4.0, 'B': 5.0})  # 指定列填充数据

     A    B  C    D
0  1.0  5.0  a  NaN
1  2.0  4.0  7  2.0
2  3.0  5.0  8  3.0
3  4.0  6.0  9  NaN

In [25]:
df = pd.DataFrame({'A': [1, 2, 3, None],
                   'B': [NaN, 4, None, 6],
                   'C': ['a', 7, 8, 9],
                   'D': [None, 2, 3, NaN]})
df

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [26]:
df.fillna(method='ffill')   # 使用前向填充的方式替换空值或缺失值

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  4.0  8  3.0
3  3.0  6.0  9  3.0

In [27]:
person_info = pd.DataFrame({'id': [1, 2, 3, 4, 4, 5],
                            'name': ['小铭', '小月月', '彭岩', '刘华', '刘华', '周华'],
                            'age': [18, 18, 29, 58, 58, 36],
                            'height': [180, 180, 185, 175, 175, 178],
                            'gender': ['女', '女', '男', '男', '男', '男']})
person_info.duplicated()         # 从前向后查找和判断是否有重复值

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [28]:
person_info.drop_duplicates()   #显示删除重复的数据行，不破坏原有的表数据

   id name  age  height gender
0   1   小铭   18     180      女
1   2  小月月   18     180      女
2   3   彭岩   29     185      男
3   4   刘华   58     175      男
5   5   周华   36     178      男

In [29]:
person_info  #查看表数据

   id name  age  height gender
0   1   小铭   18     180      女
1   2  小月月   18     180      女
2   3   彭岩   29     185      男
3   4   刘华   58     175      男
4   4   刘华   58     175      男
5   5   周华   36     178      男

In [1]:
person_info.drop_duplicates(inplace=True)   #删除重复的数据行，破坏原有的表数据

NameError: name 'person_info' is not defined

In [31]:
person_info  #查看表数据

   id name  age  height gender
0   1   小铭   18     180      女
1   2  小月月   18     180      女
2   3   彭岩   29     185      男
3   4   刘华   58     175      男
5   5   周华   36     178      男

4.1.3 异常值的处理

In [32]:
# 导入需要使用的CSV数据
file = open('./第4章数据文件资源/example_data.csv')
data = pd.read_csv(file)
data

      A  B
0     1  2
1     2  3
2     3  8
3     4  5
4     5  6
5   560  7
6     2  8
7     3  9
8     3  0
9     4  3
10    5  4
11    3  5
12    2  6
13    4  7
14    5  2
15   23  4
16    2  5
17  342  6
18    3  4

In [33]:
#定义一个函数three_sigma，通过3西格马的方式判断是否是异常值，
# ser1 表示传入DataFrame的某一列
def three_sigma(ser): 
    # 求平均值
    mean_value = ser.mean()
    # 求标准差
    std_value = ser.std()
    # 位于(μ-3σ,μ+3σ)区间的数据是正常的，不在这个区间的数据为异常的
    # ser中的数值小于μ-3σ或大于μ+3σ均为异常值
    # 一旦发现有异常值，就标注为True，否则标注为False
    #判断条件
    rule = (mean_value - 3 * std_value > ser) | (ser.mean() + 3 * ser.std() < ser)
    # 需要根据条件完成数据的索引，返回异常值的位置索引
    index = np.arange(ser.shape[0])[rule]   #获取行索引
    # 获取异常数据
    outrange = ser.iloc[index]
    return outrange

In [35]:
three_sigma(data['A'])

5    560
Name: A, dtype: int64

In [36]:
three_sigma(data.A)   #或者写成这种方式

5    560
Name: A, dtype: int64

In [37]:
three_sigma(data['B'])

Series([], Name: B, dtype: int64)

In [3]:
df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [2, 3, 5, 2],
                   'C': [1, 4, 7, 4],
                   'D': [1, 5, 30, 3]})
df

NameError: name 'pd' is not defined

In [2]:
df.boxplot(column=['A', 'B', 'C', 'D'])  #得到箱型图

NameError: name 'df' is not defined

In [40]:
df = pd.DataFrame ({'菜谱名': ['红烧肉', '铁板鱿鱼', 
                    '小炒肉', '干锅鸭掌', '酸菜鱼'],
                    '价格': [38, 25, 26, 388, 35]})
df

    菜谱名   价格
0   红烧肉   38
1  铁板鱿鱼   25
2   小炒肉   26
3  干锅鸭掌  388
4   酸菜鱼   35

In [41]:
df.replace(to_replace=388,value=38.8)

    菜谱名    价格
0   红烧肉  38.0
1  铁板鱿鱼  25.0
2   小炒肉  26.0
3  干锅鸭掌  38.8
4   酸菜鱼  35.0

4.1.4 更改数据类型

In [42]:
import pandas as pd
df = pd.DataFrame({'A':['5', '6', '7'], 'B':['3', '2', '1']})
df

   A  B
0  5  3
1  6  2
2  7  1

In [43]:
df.dtypes  # 查看数据的类型

A    object
B    object
dtype: object

In [57]:
# 创建DataFrame对象，数据的类型为int
df = pd.DataFrame({'A': ['5', '6', '7'], 'B': ['3', '2', '1']},dtype=int)
df

D:\ProgramPy\anaconda3\lib\site-packages\numpy\core\numeric.py:2446: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  return bool(asarray(a1 == a2).all())
C:\Users\vvv\AppData\Local\Temp\ipykernel_17064\1242150647.py:2: FutureWarning: Could not cast to int32, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df = pd.DataFrame({'A': ['5', '6', '7'], 'B': ['3', '2', '1']},dtype=int)

   A  B
0  5  3
1  6  2
2  7  1

In [56]:
df.dtypes

A    object
B    object
dtype: object

In [60]:
df = pd.DataFrame({'A': ['5', '6', '7'], 'B': ['3', '2', '1']})
df.astype(int)

   A  B
0  5  3
1  6  2
2  7  1

In [63]:
df.dtypes   # 查看数据的类型,可见直接在df上操作astype并不会把df中数据类型改成int

A    object
B    object
dtype: object

In [62]:
df2=df.astype(int)
df2.dtypes   # 查看数据的类型

A    int32
B    int32
dtype: object

In [65]:
df = pd.DataFrame({'A': ['1', '1.2', '4.2'],
                   'B': ['-9', '70', '88'],
                   'C': ['x', '5.0', '0']})
df

     A   B    C
0    1  -9    x
1  1.2  70  5.0
2  4.2  88    0

In [66]:
df['B'].astype(dtype='int')  # 强制转换为int类型  或者：df.B.astype(dtype='int')  也可以

0    -9
1    70
2    88
Name: B, dtype: int32

In [67]:
ser_obj = pd.Series(['1', '1.2', '4.2'])
ser_obj

0      1
1    1.2
2    4.2
dtype: object

In [68]:
# 转换object类型为float类型
pd.to_numeric(ser_obj, errors='raise')

0    1.0
1    1.2
2    4.2
dtype: float64

4.2数据合并

4.2.1 轴向堆叠数据

In [69]:
import pandas as pd
df1 = pd.DataFrame({'A': ['A0', 'A0', 'A1'],
                    'B': ['B0', 'B0', 'B1']})
df2 = pd.DataFrame({'C': ['C0', 'C0', 'C1', 'C3'],
                    'D': ['D0', 'D2', 'D2', 'D3']})

In [70]:
df1

    A   B
0  A0  B0
1  A0  B0
2  A1  B1

In [71]:
df2

    C   D
0  C0  D0
1  C0  D2
2  C1  D2
3  C3  D3

In [72]:
# 横向堆叠合并df1和df2，采用外连接的方式
pd.concat([df1, df2], join='outer', axis=1)

     A    B   C   D
0   A0   B0  C0  D0
1   A0   B0  C0  D2
2   A1   B1  C1  D2
3  NaN  NaN  C3  D3

In [73]:
first = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2'],
                      'C': ['C0', 'C1', 'C2']})
second = pd.DataFrame({'B': ['B3', 'B4', 'B5'],
                       'C': ['C3', 'C4', 'C5'],
                       'D': ['D3', 'D4', 'D5']})

In [74]:
first

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [75]:
second

    B   C   D
0  B3  C3  D3
1  B4  C4  D4
2  B5  C5  D5

In [76]:
pd.concat([first, second], join='inner', axis=0)     # axis=0 纵向轴

    B   C
0  B0  C0
1  B1  C1
2  B2  C2
0  B3  C3
1  B4  C4
2  B5  C5

In [77]:
pd.concat([first, second], join='inner', axis=1)  # axis=1 横向轴

    A   B   C   B   C   D
0  A0  B0  C0  B3  C3  D3
1  A1  B1  C1  B4  C4  D4
2  A2  B2  C2  B5  C5  D5

In [78]:
# 横向堆叠合并df1和df2，采用内连接的方式
pd.concat([df1, df2], join='inner', axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A0  B0  C0  D2
2  A1  B1  C1  D2

In [79]:
# 纵向堆叠合并df1和df2，采用外连接的方式
pd.concat([df1, df2], join='outer', axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A0   B0  NaN  NaN
2   A1   B1  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C0   D2
2  NaN  NaN   C1   D2
3  NaN  NaN   C3   D3

In [80]:
# 纵向堆叠合并df1和df2，采用内连接的方式
pd.concat([df1, df2], join='inner', axis=0)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 0, 1, 2, 3]

4.2.2 主键合并数据

In [1]:
import pandas as pd
left = pd.DataFrame({'key':['K0','K1','K2'],
                       'A':['A0','A1','A2'],
                        'B':['B0','B1','B2']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3']})

In [2]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [3]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [4]:
pd.merge(left=left, right=right, on='key',how='inner')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [5]:
pd.merge(left, right, on='key')   #写成这种方式也可以

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [6]:
left = pd.DataFrame({'key':['K0','K1','K2'],
                       'A':['A0','A1','A2'],
                       'B':['B0','B1','B2']})
right = pd.DataFrame({'key':['K0','K5','K2','K4'],
                         'B':['B0','B1','B2','B5'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3']})

In [7]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [8]:
right

  key   B   C   D
0  K0  B0  C0  D0
1  K5  B1  C1  D1
2  K2  B2  C2  D2
3  K4  B5  C3  D3

In [9]:
pd.merge(left, right, on=['key', 'B'])    #内连接的条件：['key', 'B']  两个表中要同时要有 key 和 ‘B’的值 才能生成合并后的新表

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2

In [10]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                       'B':['B0','B1','B2']})
right = pd.DataFrame({'C':['C0','C1','C2'],
                         'D':['D0','D1','D2']})

In [11]:
left

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [12]:
right

    C   D
0  C0  D0
1  C1  D1
2  C2  D2

In [13]:
pd.merge(left,right,how='outer',left_index=True,right_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

4.2.3 根据索引合并数据

In [14]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']})
right = pd.DataFrame({'C': ['C0', 'C1', 'C2'],
                         'D': ['D0', 'D1', 'D2']},
                        index=[ 'a','b','c'])

In [15]:
left

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [16]:
right

    C   D
a  C0  D0
b  C1  D1
c  C2  D2

In [23]:
right.join(left, how='outer')

      C    D    A    B  key
K0   C0   D0  NaN  NaN  NaN
K1   C1   D1  NaN  NaN  NaN
K2   C2   D2  NaN  NaN  NaN
0   NaN  NaN   A0   B0   K0
1   NaN  NaN   A1   B1   K1
2   NaN  NaN   A2   B2   K2

In [17]:
left.join(right, how='outer')

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
a  NaN  NaN   C0   D0
b  NaN  NaN   C1   D1
c  NaN  NaN   C2   D2

In [19]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2'],
                      'key': ['K0', 'K1', 'K2']})
right = pd.DataFrame({'C': ['C0', 'C1','C2'],
                         'D': ['D0', 'D1','D2']},
                        index=['K0', 'K1','K2'])

In [20]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [21]:
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [22]:
# on参数指定连接的列名
left.join(right, how='left', on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

4.2.4 合并重叠数据

In [24]:
import pandas as pd
import numpy as np
from numpy import NAN
left = pd.DataFrame({'A': [np.nan, 'A1', 'A2', 'A3'],
                        'B': [np.nan, 'B1', np.nan, 'B3'],
                        'key': ['K0', 'K1', 'K2', 'K3']})
right = pd.DataFrame({'A': ['C0', 'C1','C2'],
                         'B': ['D0', 'D1','D2']},
                         index=[1,0,2])

In [25]:
left

     A    B key
0  NaN  NaN  K0
1   A1   B1  K1
2   A2  NaN  K2
3   A3   B3  K3

In [26]:
right

    A   B
1  C0  D0
0  C1  D1
2  C2  D2

In [27]:
# 用right的数据填充left缺失的部分
left.combine_first(right)

    A   B key
0  C1  D1  K0
1  A1  B1  K1
2  A2  D2  K2
3  A3  B3  K3

4.3 数据重塑

In [31]:
df = pd.DataFrame({'A':['A0','A1','A2'],
                 'B':['B0','B1','B2']})

In [32]:
df

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [33]:
df.stack()

0  A    A0
   B    B0
1  A    A1
   B    B1
2  A    A2
   B    B2
dtype: object

In [34]:
ret=df.stack()

In [35]:
ret

0  A    A0
   B    B0
1  A    A1
   B    B1
2  A    A2
   B    B2
dtype: object

In [36]:
type(ret)

pandas.core.series.Series

In [37]:
ret.unstack()

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [38]:
df = pd.DataFrame(np.array([[26,20,22,26],[30,25,24,20]]),
                   index=['男生人数','女生人数'],
                   columns=[['一楼','一楼','二楼','二楼'],
                              ['A教室','B教室','A教室','B教室']])
df

      一楼      二楼
     A教室 B教室 A教室 B教室
男生人数  26  20  22  26
女生人数  30  25  24  20

In [39]:
df.stack()

          一楼  二楼
男生人数 A教室  26  22
     B教室  20  26
女生人数 A教室  30  24
     B教室  25  20

In [40]:
df.stack(level=0)   # 旋转外层索引

         A教室  B教室
男生人数 一楼   26   20
     二楼   22   26
女生人数 一楼   30   25
     二楼   24   20

4.3.2 轴向旋转

In [41]:
df =  pd.DataFrame({'商品名称': ['荣耀9青春版','小米6x','OPPO A1',
                   '荣耀9青春版','小米6x','OPPO A1'],
                   '出售日期': ['2017年5月25日', '2017年5月25日',
                   '2017年5月25日','2017年6月18日',
                   '2017年6月18日', '2017年6月18日'],
                   '价格': ['999元', '1399元', '1399元',
                   '800元', '1200元', '1250元']})
df

      商品名称        出售日期     价格
0   荣耀9青春版  2017年5月25日   999元
1     小米6x  2017年5月25日  1399元
2  OPPO A1  2017年5月25日  1399元
3   荣耀9青春版  2017年6月18日   800元
4     小米6x  2017年6月18日  1200元
5  OPPO A1  2017年6月18日  1250元

In [42]:
df.pivot(index='出售日期', columns='商品名称', values='价格')     #index 行索引      column 列索引     values  填充值

商品名称       OPPO A1   小米6x 荣耀9青春版
出售日期
2017年5月25日   1399元  1399元   999元
2017年6月18日   1250元  1200元   800元

4.4 转换数据

4.4.1 重命名轴索引

In [43]:
df = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                 'B':['B0', 'B1', 'B2', 'B3'],
                 'C':['C0', 'C1', 'C2', 'C3']})
df

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [44]:
# 重命名列索引的名称，并且在原有数据上进行修改
df.rename(columns={'A':'aa', 'B':'bb', 'C':'cc'}, inplace=True)     #inplace=True,表示 在原有的基础上替换
df

   aa  bb  cc
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [45]:
df.rename(str.upper,axis='columns')

   AA  BB  CC
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [46]:
df.rename(index={1: 'a', 2: 'b',3:'c'}, inplace=True)

In [47]:
df

   aa  bb  cc
0  A0  B0  C0
a  A1  B1  C1
b  A2  B2  C2
c  A3  B3  C3

4.4.2 离散化连续数据

In [48]:
# 使用pandas的cut函数划分年龄组
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 32]
bins = [0, 18, 25, 35, 60, 100]
cuts = pd.cut(ages, bins)
cuts

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (25, 35], (60, 100], (35, 60], (25, 35]]
Length: 11
Categories (5, interval[int64, right]): [(0, 18] < (18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [49]:
pd.cut(ages, bins=bins, right=False)   #更改右边区间闭合

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [35, 60), [25, 35), [60, 100), [35, 60), [25, 35)]
Length: 11
Categories (5, interval[int64, left]): [[0, 18) < [18, 25) < [25, 35) < [35, 60) < [60, 100)]

4.4.3 哑变量处理类别型数据

In [53]:
#将年龄数据处理成类别型数据
ret=pd.cut(ages,bins,labels=['少年','青年','中年','中老年','老年'])
ret
#将处理的类别型数据转换为哑变量矩阵

['青年', '青年', '青年', '中年', '青年', ..., '中老年', '中年', '老年', '中老年', '中年']
Length: 11
Categories (5, object): ['少年' < '青年' < '中年' < '中老年' < '老年']

In [55]:
pd.get_dummies(ret, prefix='年龄类别:')  # 哑变量处理

    年龄类别:_少年  年龄类别:_青年  年龄类别:_中年  年龄类别:_中老年  年龄类别:_老年
0          0         1         0          0         0
1          0         1         0          0         0
2          0         1         0          0         0
3          0         0         1          0         0
4          0         1         0          0         0
5          0         1         0          0         0
6          0         0         0          1         0
7          0         0         1          0         0
8          0         0         0          0         1
9          0         0         0          1         0
10         0         0         1          0         0

In [56]:
df1 = pd.DataFrame({'职业': ['工人', '学生', '司机', '教师', '导游']})
df1

   职业
0  工人
1  学生
2  司机
3  教师
4  导游

In [57]:
pd.get_dummies(df1, prefix=['col'])  # 哑变量处理

   col_司机  col_学生  col_导游  col_工人  col_教师
0       0       0       0       1       0
1       0       1       0       0       0
2       1       0       0       0       0
3       0       0       0       0       1
4       0       0       1       0       0